app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new
    @tweet.username = current_user.username
    @tweet.content = params[:tweet][:content]
    @tweet.save
    @no_space_content = @tweet.content.gsub(" ", "")
    @no_space_content = @tweet.content.gsub("　", "")
    @no_space_content += "aa"
    #filtering
    filepath = "/config/language_filters/list.yaml"
    #filepath.force_encoding('UTF-8') filepath = filepath.encode('UTF-8', 'UTF-8')
    filter = LanguageFilter::Filter.new matchlist: File.join(Rails.root,filepath), replacement: :stars
    if filter.match?(@no_space_content)
      @black = Black.new
      @black.username = @tweet.username
      @black.content = @tweet.content
      @black.save
      redirect_to '/tweets/fail'
    else
      @white = White.new
      @white.username = @tweet.username
      @white.content = @tweet.content
      @white.save
---
INSERT INTO "tweets" ("username", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yjsnpi"], ["content", "あああ"], ["created_at", "2017-07-12 11:03:38.231132"], ["updated_at", "2017-07-12 11:03:38.231132"]]
INSERT INTO "blacks" ("username", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yjsnpi"], ["content", "まんこ"], ["created_at", "2017-07-12 11:06:34.800749"], ["updated_at", "2017-07-12 11:06:34.800749"]]
INSERT INTO "whites" ("username", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "yjsnpi"], ["content", "あああ"], ["created_at", "2017-07-12 11:03:38.262446"], ["updated_at", "2017-07-12 11:03:38.262446"]]